iabdalkader/ArduinoCore-zephyr/boards.txt
unor4wifi.bootloader.tool=pyocd
unor4wifi.bootloader.tool.default=pyocd
unor4wifi.bootloader.file=zephyr-{build.variant}.elf
unor4wifi.bootloader.target=r7fa4m1ab

##########################################################################################

opta.name=Arduino Opta
opta.build.core=arduino
opta.build.crossprefix=arm-zephyr-eabi-
opta.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

opta.menu.debug.false=Standard
opta.menu.debug.true=Debug
opta.menu.debug.true.build.zsk_args.debug=-debug

opta.menu.link_mode.dynamic=Dynamic
opta.menu.link_mode.static=Static
opta.menu.link_mode.static.build.link_mode=static
opta.menu.link_mode.static.upload.extension=bin-zsk.bin

opta.build.zephyr_target=arduino_opta//m7
opta.build.zephyr_args=
opta.build.zephyr_hals=hal_stm32 hal_infineon
opta.build.artifact=zephyr_main
opta.build.variant=arduino_opta_stm32h747xx_m7
opta.build.mcu=cortex-m7
opta.build.fpu=-mfpu=fpv5-d16
opta.build.architecture=cortex-m7

opta.build.float-abi=-mfloat-abi=softfp
opta.build.extra_flags=
opta.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
opta.build.architecture=cortex-m7
opta.build.board=OPTA
opta.vid.0=0x2341
opta.pid.0=0x0064
opta.upload_port.0.vid=0x2341
opta.upload_port.0.pid=0x0364

opta.upload.tool=dfu-util
opta.upload.tool.default=dfu-util
opta.upload.protocol=
opta.upload.transport=
opta.upload.vid=0x2341
opta.upload.pid=0x0364
opta.upload.interface=0
opta.upload.use_1200bps_touch=true
opta.upload.wait_for_upload_port=true
opta.upload.native_usb=true
opta.upload.maximum_size=1966080
opta.upload.maximum_data_size=523624

opta.upload.address=0x080E0000

opta.upload.maximum_size=786432
opta.upload.maximum_data_size=523624

opta.bootloader.tool=dfu-util
opta.bootloader.tool.default=dfu-util
opta.bootloader.vid=0x2341
opta.bootloader.pid=0x0364
opta.bootloader.interface=0
opta.bootloader.file=zephyr-{build.variant}.bin
opta.bootloader.address=0x08040000

opta.debug.tool=gdb
opta.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
opta.debug.server.openocd.scripts.1={programmer.transport_script}
opta.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
opta.debug.cortex-debug.custom.request=attach
opta.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##########################################################################################

nano_matter.name=Arduino Nano Matter
nano_matter.build.core=arduino
nano_matter.build.crossprefix=arm-zephyr-eabi-
nano_matter.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

nano_matter.menu.link_mode.dynamic=Dynamic
nano_matter.menu.link_mode.static=Static
nano_matter.menu.link_mode.static.build.link_mode=static
nano_matter.menu.link_mode.static.upload.extension=bin-zsk.bin

nano_matter.build.zephyr_target=arduino_nano_matter
nano_matter.build.zephyr_args=
nano_matter.build.zephyr_hals=hal_silabs
nano_matter.build.artifact=zephyr_main
nano_matter.build.variant=arduino_nano_matter_mgm240sd22vna
nano_matter.build.mcu=cortex-m33
nano_matter.build.fpu=-mfpu=fpv4-sp-d16
nano_matter.build.architecture=cortex-m33

nano_matter.build.float-abi=-mfloat-abi=hard
nano_matter.build.extra_flags=
nano_matter.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nano_matter.build.architecture=cortex-m33
nano_matter.build.board=ARDUINO_NANO_MATTER
nano_matter.vid.0=0x2341
nano_matter.pid.0=0x0072
nano_matter.upload_port.0.vid=0x2341
nano_matter.upload_port.0.pid=0x0072

nano_matter.upload.tool=openocd
nano_matter.upload.tool.default=openocd
nano_matter.upload.config=-f target/efm32s2_g23.cfg
nano_matter.upload.programmer=-f interface/cmsis-dap.cfg
nano_matter.upload.maximum_data_size=262144
nano_matter.upload.maximum_size=1572864
nano_matter.upload.address=0x080C4000
nano_matter.upload.protocol=SWD
nano_matter.upload.setup_command=
nano_matter.upload.use_1200bps_touch=false
nano_matter.upload.wait_for_upload_port=false
nano_matter.upload.native_usb=false

nano_matter.bootloader.tool=openocd
nano_matter.bootloader.tool.default=openocd
nano_matter.bootloader.vid=0x2341
nano_matter.bootloader.pid=0x0072
nano_matter.bootloader.interface=0
nano_matter.bootloader.file=zephyr-{build.variant}.hex
nano_matter.bootloader.target=arduino_nano_matter

nano_matter.debug.server=openocd
nano_matter.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
nano_matter.debug.server.openocd.scripts.1=target/efm32s2_g23.cfg
nano_matter.debug.cortex-debug.custom.postAttachCommands.0=monitor reset halt
#nano_matter.debug.cortex-debug.custom.postAttachCommands.1=monitor reset_config srst_nogate
#nano_matter.debug.cortex-debug.custom.postAttachCommands.2=monitor gdb_breakpoint_override hard
nano_matter.debug.cortex-debug.custom.postAttachCommands.3=monitor gdb_sync
nano_matter.debug.cortex-debug.custom.postAttachCommands.4=c
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.0=monitor reset halt
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.1=monitor gdb_sync
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.2=c
nano_matter.debug.cortex-debug.custom.request=attach

##############################################################################################################

unoq.name=Arduino UNO Q
unoq.build.core=arduino
unoq.build.crossprefix=arm-zephyr-eabi-
unoq.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

unoq.menu.link_mode.dynamic=Dynamic
unoq.menu.link_mode.static=Static
unoq.menu.link_mode.static.build.link_mode=static
unoq.menu.link_mode.static.upload.extension=bin-zsk.bin

unoq.menu.wait_linux_boot.yes=Wait for Linux
unoq.menu.wait_linux_boot.no=Immediate
unoq.menu.wait_linux_boot.no.build.boot_mode=immediate
unoq.menu.wait_linux_boot.app=Wait for App
unoq.menu.wait_linux_boot.app.build.boot_mode=app

unoq.build.zephyr_target=arduino_uno_q
unoq.build.zephyr_args=
unoq.build.variant=arduino_uno_q_stm32u585xx
unoq.build.artifact=zephyr_unoq
unoq.build.subarch=zephyr
unoq.build.mcu=cortex-m33
unoq.build.fpu=-mfpu=fpv5-sp-d16
unoq.build.architecture=cortex-m33
unoq.compiler.zephyr.arch.define=

unoq.openocd_cfg=flash_sketch.cfg

unoq.build.float-abi=-mfloat-abi=hard
unoq.build.extra_flags=
unoq.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
unoq.build.board=UNO_Q
unoq.build.zephyr_hals=hal_stm32
unoq.compiler.zephyr.arch.define=
unoq.compiler.zephyr=
unoq.vid.0=0x2341
unoq.pid.0=0x0078
unoq.upload_port.0.vid=0x2341
unoq.upload_port.0.pid=0x0078
unoq.upload.address=0x8100000
unoq.upload.target=stm32u585zitxq

unoq.upload.tool=remoteocd
unoq.upload.tool.default=remoteocd
unoq.upload.tool.network=remoteocd_network
unoq.upload.protocol=
unoq.upload.transport=
unoq.upload.vid=0x2341
unoq.upload.pid=0x0078
unoq.upload.interface=0
unoq.upload.use_1200bps_touch=false
unoq.upload.wait_for_upload_port=false
unoq.upload.native_usb=true
unoq.upload.maximum_size=1966080
unoq.upload.maximum_data_size=523624

unoq.bootloader.tool=remoteocd
unoq.bootloader.tool.default=remoteocd
unoq.bootloader.file=zephyr-{build.variant}.elf
unoq.bootloader.target=stm32u585zitxq

##########################################################################################
